import {Component} from "@angular/core";

@Component({
  templateUrl:'./home-content-detail.component.html',
  styleUrls:['./home.component.css']
})
export class HomeContentDetailComponent {

  testContent = `
    ### 这是一篇测试标题
>  这是一个测试引用，这是一个测试引用这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用

#### 这是一个测试小标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容

#### 标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
\`\`\`java
public static void main(String[] args){
    System.out.println(" Hello World");
}
\`\`\`
---
#### 这是一个测试
一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
### 这是一篇测试标题
>  这是一个测试引用，这是一个测试引用这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用

#### 这是一个测试小标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容

#### 标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
\`\`\`java
public static void main(String[] args){
    System.out.println(" Hello World");
}
\`\`\`
---
#### 这是一个测试
一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
### 这是一篇测试标题
>  这是一个测试引用，这是一个测试引用这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用

#### 这是一个测试小标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容

#### 标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
\`\`\`java
public static void main(String[] args){
    System.out.println(" Hello World");
}
\`\`\`
---
#### 这是一个测试
一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
### 这是一篇测试标题
>  这是一个测试引用，这是一个测试引用这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用

#### 这是一个测试小标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容

#### 标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
\`\`\`java
public static void main(String[] args){
    System.out.println(" Hello World");
}
\`\`\`
---
#### 这是一个测试
一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
### 这是一篇测试标题
>  这是一个测试引用，这是一个测试引用这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用，这是一个测试引用

#### 这是一个测试小标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容

#### 标题

一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容
\`\`\`java
public static void main(String[] args){
    System.out.println(" Hello World");
}
\`\`\`
---
#### 这是一个测试
一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容一些内容

  `;

}
